print('================Чек================')
t = input()
print('Товар:' + ' ' * (35 - 6 - len(t)) + t)
p = input()
v = input()
m = input()
s = int(m) - int(p) * int(v)
s1 = v + 'кг * ' + p + 'руб/кг'
s2 = str(int(p) * int(v)) + 'руб'
s3 = str(s) + 'руб'
s4 = m + 'руб'
print('Цена:', ' ' * (35 - 6 - len(s1)) + s1)
print('Итого: ' + ' ' * (35 - 7 - len(s2)) + s2)
print('Внесено: ' + ' ' * (35 - 9 - len(s4)) + s4)
print('Сдача:' + ' ' * (35 - 6 - len(s3)) + s3)
print('===================================')